Catalogs/ТЦКлиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ТЦКлиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресБраузера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтладчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметрыПрикладногоРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаВызова</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаПередачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаПолучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмитироватьЗадержку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛокализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦКомпьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачинатьОтладку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОчищатьСлужебныеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПредупреждать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НизкаяСкоростьСоединения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсеФункции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоказатели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПрокси</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешатьОтладку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАутентификацииВеб</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦТипАутентификацииВеб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБраузера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦТипБраузера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗапускаКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦТипЗапускаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦТипКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрокси</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦТипПрокси</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разделители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТЦТипКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТЦТипКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тонкий1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТонкийВеб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Веб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолстыйУправляемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолстыйОбычный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТЦТипБраузера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТЦТипБраузера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InternetExplorer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Firefox</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chrome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Safari</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТЦТипПрокси.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТЦТипПрокси</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоОпределение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УказатьНастройки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТЦТипАутентификацииВеб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТЦТипАутентификацииВеб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Авто</Name>
					<Comment>установка обязательного применения аутентификации операционной системы при старте 1С:Предприятия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмяПароль</Name>
					<Comment>запрет применения аутентификации операционной системы при старте 1С:Предприятия</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТЦКлиенты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		Если ПроверитьЗаполнение() Тогда
			СтрокаЗапуска = СобратьСтрокуЗапуска();
		Иначе
			Отказ = Истина;
		КонецЕсли;
	Исключение
		Отказ = Истина;
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
	КонецПопытки;
	
КонецПроцедуры // ПередЗаписью()

// Собрать строку запуска из значений реквизитов
//
// Возвращаемое значение:
//  Строка - строка запуска клиента
//
Функция СобратьСтрокуЗапуска() Экспорт
	
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоLinux = СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86
	       Или СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
	СтрокаЗапуска = "%EXE%";
	
	Если Не АвтоПуть Тогда
		КорректноеИмяКаталога = ТЦОбщий.СкорректироватьПуть(ИмяКаталога);
		
		Если ЗначениеЗаполнено(КорректноеИмяКаталога) Тогда
			РазделительПути = ТЦОбщий.ОпределитьРазделительПути(ИмяКаталога);
		Иначе
			РазделительПути = "";
		КонецЕсли; 
		
		Путь = КорректноеИмяКаталога + РазделительПути + ИмяФайла;
		СтрокаЗапуска = СтрЗаменить(СтрокаЗапуска, "%EXE%", ТЦОбщий.ЭкранироватьСтроку(Путь));
	КонецЕсли;
	
	Если ТипКлиента = Перечисления.ТЦТипКлиента.ТолстыйУправляемый Или
	     ТипКлиента = Перечисления.ТЦТипКлиента.ТолстыйОбычный Тогда
		СтрокаЗапуска = СтрокаЗапуска + " ENTERPRISE";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		СтрокаЗапуска = СтрокаЗапуска + " " + ДополнительныеПараметры;
	КонецЕсли;
	
	Если ТипКлиента = Перечисления.ТЦТипКлиента.ТолстыйОбычный Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "RunModeOrdinaryApplication",, ЭтоLinux);
	ИначеЕсли ТипКлиента = Перечисления.ТЦТипКлиента.ТолстыйУправляемый Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "RunModeManagedApplication",, ЭтоLinux);
	ИначеЕсли ТипКлиента = Перечисления.ТЦТипКлиента.Веб Тогда
		Если ТипБраузера = Перечисления.ТЦТипБраузера.ПоУмолчанию Тогда
			СтрокаЗапуска = "";
		КонецЕсли;
		
		Разделитель = ?(ПустаяСтрока(СтрокаЗапуска), "", " ");
		СтрокаЗапуска = СтрокаЗапуска + Разделитель + ТЦОбщий.ЭкранироватьСтрокуURL(АдресБраузера);
	КонецЕсли;
	
	Если НеПредупреждать Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "DisableStartupMessages",, ЭтоLinux);
	КонецЕсли;
	
	Если РазрешатьОтладку Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "Debug",, ЭтоLinux);
	КонецЕсли;
	
	Если РазрешатьОтладку И НачинатьОтладку Тогда
		Если ЗначениеЗаполнено(АдресОтладчика) Тогда
			СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
				ТипКлиента, СтрокаЗапуска, "DebuggerURL", АдресОтладчика, ЭтоLinux);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипКлиента <> Перечисления.ТЦТипКлиента.ТолстыйОбычный И ОтображатьПоказатели Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "DisplayPerformance",, ЭтоLinux);
	КонецЕсли;
	
	Если ТипКлиента <> Перечисления.ТЦТипКлиента.ТолстыйОбычный И ОтображатьВсеФункции Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "DisplayAllFunctions",, ЭтоLinux);
	КонецЕсли;
	
	ЭтоВеб = ТипКлиента = Перечисления.ТЦТипКлиента.Веб;
	ЭтоТонкий1С = ТипКлиента = Перечисления.ТЦТипКлиента.Тонкий1С;
	ЭтоТонкийВеб = ТипКлиента = Перечисления.ТЦТипКлиента.ТонкийВеб;
	ЭтоТонкий = ЭтоТонкий1С Или ЭтоТонкийВеб;
	
	Если (ЭтоВеб Или ЭтоТонкий) И НизкаяСкоростьСоединения Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "O", "Low", ЭтоLinux);
	КонецЕсли;
	
	Если ИмитироватьЗадержку И ТипКлиента <> Перечисления.ТЦТипКлиента.Веб Тогда
		ФорматЧисла = "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=0";
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "SimulateServerCallDelay",, ЭтоLinux);
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска,, "-Call" + Формат(ЗадержкаВызова, ФорматЧисла), ЭтоLinux);
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска,, "-Send" + Формат(ЗадержкаПередачи, ФорматЧисла), ЭтоLinux);
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска,, "-Receive" + Формат(ЗадержкаПолучения, ФорматЧисла), ЭтоLinux);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрЗапуска) Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "C", ПараметрЗапуска, ЭтоLinux);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Язык) Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "L", Язык, ЭтоLinux);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодЛокализации) Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "VL", КодЛокализации, ЭтоLinux);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФайлСообщений)
		И ТипКлиента <> Перечисления.ТЦТипКлиента.Веб
		И ТипКлиента <> Перечисления.ТЦТипКлиента.Тонкий1С
		И ТипКлиента <> Перечисления.ТЦТипКлиента.ТонкийВеб Тогда
		
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "Out", ФайлСообщений, ЭтоLinux);
		
		Если НеОчищатьСлужебныеСообщения Тогда
			СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
				ТипКлиента, СтрокаЗапуска,, "-NoTruncate", ЭтоLinux);
		КонецЕсли;
	КонецЕсли;
		
	Если ТипКлиента = Перечисления.ТЦТипКлиента.ТонкийВеб Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "WS", АдресБраузера, ЭтоLinux);
	КонецЕсли;
	
	Если ТипКлиента = Перечисления.ТЦТипКлиента.ТонкийВеб И
	     ТипПрокси = Перечисления.ТЦТипПрокси.НеИспользовать Тогда
		СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "NoProxy",, ЭтоLinux);
	КонецЕсли;
	
	Если ТипКлиента = Перечисления.ТЦТипКлиента.ТонкийВеб И
	     ТипПрокси = Перечисления.ТЦТипПрокси.УказатьНастройки Тогда
		ЕстьАдрес = ЗначениеЗаполнено(АдресПрокси);
		ЕстьПорт = ЗначениеЗаполнено(ПортПрокси);
		ЕстьПользователь = ЗначениеЗаполнено(ПользовательПрокси);
		ЕстьПароль = ЗначениеЗаполнено(ПарольПрокси);
		
		Если ЕстьАдрес И ЕстьПорт Тогда
			СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
				ТипКлиента, СтрокаЗапуска, "Proxy",, ЭтоLinux);
			
			Если ЕстьАдрес Тогда
				СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
					ТипКлиента, СтрокаЗапуска,, "-PSrv" + АдресПрокси, ЭтоLinux);
			КонецЕсли;
			
			Если ЕстьПорт Тогда
				СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
					ТипКлиента, СтрокаЗапуска,, "-PPort" + Формат(ПортПрокси, "ЧГ=0"), ЭтоLinux);
			КонецЕсли;
			
			Если ЕстьПользователь Тогда
				СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
					ТипКлиента, СтрокаЗапуска,, "-PUser" + ПользовательПрокси, ЭтоLinux);
			КонецЕсли;
			
			Если ЕстьПароль Тогда
				СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
					ТипКлиента, СтрокаЗапуска,, "-PPasswd" + ПарольПрокси, ЭтоLinux);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если (ЭтоВеб Или ЭтоТонкийВеб) И
	     ТипАутентификацииВеб = Перечисления.ТЦТипАутентификацииВеб.ИмяПароль Тогда
		 СтрокаЗапуска = ТЦОбщий.ДобавитьПараметрКлиента(
			ТипКлиента, СтрокаЗапуска, "WSA-",, ЭтоLinux);
	КонецЕсли;
	
		
	Возврат СтрокаЗапуска;
	
КонецФункции // СобратьСтрокуЗапуска()
